Diagramas de secuencia/post-mutant-sequence-diagram.mmd
sequenceDiagram
    participant Client
    participant MutantController
    participant MutantService
    participant DnaRecordRepository
    participant MutantDetector
    participant Database

    Client->>+MutantController: POST /mutant con JSON(dna)
    activate MutantController
    
    MutantController->>+MutantService: analyzeDnaAndSave(dna)
    activate MutantService
    
    %% --- Lógica de Servicio ---
    MutantService->>MutantService: calculateDnaHash(dna)
    MutantService->>+DnaRecordRepository: findByDnaHash(hash)
    activate DnaRecordRepository
    DnaRecordRepository->>+Database: SELECT * FROM dna_records ...
    activate Database
    Database-->>DnaRecordRepository: Optional<DnaRecord>
    deactivate Database
    DnaRecordRepository-->>MutantService: Optional<DnaRecord>
    deactivate DnaRecordRepository

    alt ADN ya existe en la BD (Cache Hit)
        %% El servicio ya tiene el resultado
    else ADN es nuevo (Cache Miss)
        
        MutantService->>+MutantDetector: isMutant(dna)
        activate MutantDetector
        
        Note over MutantDetector: 1. Valida y crea la matriz char[][]
        
        loop Para cada celda (row, col)
            Note over MutantDetector: 2. Busca secuencias (H, V, Diagonales)
            alt Si encuentra una secuencia
                Note over MutantDetector: 3. sequencesCount++
                alt Si sequencesCount >= 2
                    Note over MutantDetector: 4. ¡Terminación Anticipada!
                    MutantDetector-->>MutantService: return true
                    deactivate MutantDetector
                end
            end
        end
        
        MutantDetector-->>MutantService: return false
        deactivate MutantDetector
        
        MutantService->>+DnaRecordRepository: save(new DnaRecord)
        activate DnaRecordRepository
        DnaRecordRepository->>+Database: INSERT INTO ...
        activate Database
        Database-->>DnaRecordRepository: DnaRecord guardado
        deactivate Database
        DnaRecordRepository-->>MutantService: DnaRecord guardado
        deactivate DnaRecordRepository
    end
    
    MutantService-->>MutantController: return boolean isMutant
    deactivate MutantService
    
    %% --- Decisión Final del Controlador ---
    alt Resultado es mutante
        MutantController->>Client: HTTP 200 OK
    else Resultado es humano
        MutantController->>Client: HTTP 403 Forbidden
    end
    deactivate MutantController
